Autodesk.Revit.DB.DocumentType
Types of Revit documents.
Since:
2010

Autodesk.Revit.DB.DocumentType.Other
Document of another type.

Autodesk.Revit.DB.DocumentType.BuildingComponent
Building Component document.

Autodesk.Revit.DB.DocumentType.IFC
IFC document.

Autodesk.Revit.DB.DocumentType.Template
Template document.

Autodesk.Revit.DB.DocumentType.Family
Family document.

Autodesk.Revit.DB.DocumentType.Project
Project document.